<?php

namespace App\Http\Controllers\Library\Code;

use App\Http\Controllers\Controller;
use Illuminate\Http\Request;

class CainiaoErrorCode extends Controller
{
    //异常code

    /**
     * 签收异常code
     * @param $code
     * @return string
     */
    public static function SignCode($code){

        switch ($code){
            case '5206':
                return'包裹因到付件被集运仓拒签，请联系卖家并申请退款';
                break;
            case '5223':
                return '您的包裹内存在禁限运商品，因政策限制集运仓无法收件转运，目前已经拒签返回给卖家，您可联系卖家发起【仅退款】，告知卖家商品会被集运仓自动退回。退款处理中如有问题，建议联系淘宝小蜜寻求帮助哦';
                break;
            case '5204':
                return '您的包裹因超出该配送方式体积重量运送限制，无法收件转运，目前已经拒签返回给卖家，您可联系卖家发起【仅退款】，告知卖家商品会被集运仓自动退回。退款处理中如有问题，建议联系淘宝小蜜寻求帮助哦';
                break;
            case '5201':
                return '您的包裹破损严重无法收件转运，目前已经拒签返回给卖家，您可联系卖家发起【仅退款】，告知卖家商品会被集运仓自动退回。退款处理中如有问题，建议联系淘宝小蜜寻求帮助哦';
                break;
            case '503':
                return '您的包裹内存在液体物品，因无法辨认成份，影响快件运输安全无法收件转运，目前已经拒签返回给卖家，您可联系卖家发起【仅退款】，告知卖家商品会被集运仓自动退回。退款处理中如有问题，建议联系淘宝小蜜寻求帮助哦';
                break;
            case '504':
                return '包裹因含磁性物品被集运仓拒签，请联系卖家并申请退款';
                break;
            case '505':
                return '包裹因含带电物品被集运仓拒签，请联系卖家并申请退款';
                break;
            case '506':
                return '您的包裹存在动植物活体，因违反《禁止出口货物目录》相关法规要求无法收件转运，目前已经拒签返回给卖家，您可联系卖家发起【仅退款】，告知卖家商品会被集运仓自动退回。退款处理中如有问题，建议联系淘宝小蜜寻求帮助哦';
                break;
            case '507':
                return '您的包裹内含食品，属“涉检涉证敏感货物”无法收件转运，目前已经拒签返回给卖家，您可联系卖家发起【仅退款】，告知卖家商品会被集运仓自动退回。退款处理中如有问题，建议联系淘宝小蜜寻求帮助哦';
                break;
            case '508':
                return '包裹因含粉末被集运仓拒签，请联系卖家并申请退款';
                break;
            case '509':
                return '包裹因含不可运商品被集运仓拒签，请联系卖家并申请退款';
                break;
            case '510':
                return '受海关政策要求，您的包裹内含海关限制运输物品无法收件转运，目前已经拒签返回给卖家，您可联系卖家发起【仅退款】，告知卖家商品会被集运仓自动退回。退款处理中如有问题，建议联系淘宝小蜜寻求帮助哦';
                break;
            case '5241':
                return '很抱歉，您的包裹因客户取消订单被集运仓拒签，请联系卖家并申请退款';
                break;
            case '5014':
                return '该订单已入库，卖家发货关联其他订单一同打包，您在待合包页面找到对应包裹操作合包即可收到关联订单的所有商品哦';
                break;
            case '5279':
                return '因快递单号重复，集运仓签收失败，请联系卖家并申请退款';
                break;
            case '512':
                return '很抱歉，您的包裹因含易碎品，无法运送，将被集运仓拒收退回卖家，请联系卖家并申请退款';
                break;
            case '515':
                return '很抱歉，您的包裹因含不可运商品，无法运送，将被集运仓拒收退回卖家，请联系卖家并申请退款';
                break;
            case '513':
                return '很抱歉，您的包裹因含药品类商品，无法运送，将被集运仓拒收退回卖家，请联系卖家并申请退款';
                break;
            case '5202':
                return '您的包裹因卖家发货不规范原因，导致关联多个客户收件信息无法正常签收，包裹已经拒签返回给卖家，您可联系卖家发起【仅退款】，告知卖家商品会被集运仓自动退回。退款处理中如有问题，您可联系淘宝平台客服寻求帮助哦';
                break;
            case '5203':
                return '您的包裹因商品订单发生退款被取消，集运仓无法正常收入，包裹已经拒签返回给卖家，您可联系卖家发起【仅退款】，告知卖家商品会被集运仓自动退回。退款处理中如有问题，您可联系淘宝平台客服寻求帮助哦';
                break;
            case '5205':
                return '您的包裹由于下单时未选择“菜鸟跨境物流”运输方式，集运仓无法正常收入，包裹已经拒签返回给卖家，您可联系卖家发起【仅退款】，告知卖家商品会被集运仓自动退回。退款处理中如有问题，您可联系淘宝平台客服寻求帮助哦';
                break;
        }
    }

    /**
     * 入库异常code
     * @param $code
     * @return string
     */
    public function  InboundCode($code){

        switch ($code){
            case '5206':
                return'很抱歉，您的包裹因为是到付件，将被中转仓拒收退回卖家，请联系卖家并申请退款';
                break;
            case '5241':
                return '因您取消订单，包裹入库失败';
                break;
            case '5204':
                return '包裹因重量尺寸超限无法正常入库，请联系卖家并申请退款';
                break;
            case '5201':
                return '很抱歉，您的包裹因为破损，将被集运仓拒收退回卖家，请联系卖家并申请退款';
                break;
            case '503':
                return '包裹因破损无法正常入库，请联系卖家并申请退款';
                break;
            case '504':
                return '包裹因含磁性物品无法正常入库，请联系卖家并申请退款';
                break;
            case '505':
                return '包裹因含带电物品无法正常入库，请联系卖家并申请退款';
                break;
            case '506':
                return '您的包裹存在动植物活体，因违反《禁止出口货物目录》相关法规要求无法收件转运，目前已经拒签返回给卖家，您可联系卖家发起【仅退款】，告知卖家商品会被集运仓自动退回。退款处理中如有问题，建议联系淘宝小蜜寻求帮助哦';
                break;
            case '507':
                return '包裹因含动植物活体无法正常入库，请联系卖家并申请退款';
                break;
            case '508':
                return '包裹因含粉末无法正常入库，请联系卖家并申请退款';
                break;
            case '509':
                return '包裹因含不可运商品无法正常入库，请联系卖家并申请退款';
                break;
            case '512':
                return '很抱歉，您的包裹因含易碎品，无法运送，将被集运仓拒收退回卖家，请联系卖家并申请退款';
                break;
            case '515':
                return '很抱歉，您的包裹因含不可运商品，无法运送，将被集运仓拒收退回卖家，请联系卖家并申请退款';
                break;
            case '510':
                return '很抱歉，您的包裹因含药品类商品，无法运送，将被集运仓拒收退回卖家，请联系卖家并申请退款';
                break;
            case '5266':
                return '包裹因商品品类少发无法正常入库，请联系卖家处理';
                break;
            case '5268':
                return '包裹因商品数量少发货无法正常入库，请联系卖家处理';
                break;
            case '5269':
                return '包裹因错发货无法正常入库，请联系卖家处理';
                break;
        }

    }

    /**
     * 出库失败code
     * @param $code
     * @return string
     */
    public function OutBound($code){

        switch ($code){
            case '5216':
                return'包裹丢失，请联系客服退款';
                break;
            case '5215':
                return '包裹破损，请联系客服处理';
                break;
            case '5264':
                return '抱歉，您的包裹因超出自提点尺寸重量无法放置在自提点，官方物流为您按照您下单时填写的收货地址安排送货上门，您无需支付运费差价及住宅/偏远等附加费，如有疑问可联系官方物流客服处理。
0927更新：包裹无法正常出库，请联系客服处理';
                break;
            case '5257':
                return '很抱歉，您的包裹超过自提柜尺寸重量限制, 将为您调整到附近自提点取货，如有其他需要帮助请您点击“联系官方物流客服”处理';
                break;
            case '5277':
                return '由于您的订单已超目的地进口免税额，请联系客服处理。';
                break;

        }
    }

}
